{
  "projects": [
    {
      "title": "GitHub Analyzer",
      "start_date": "Dec 2024",
      "end_date": "currently working",
      "description": [
        "Architected a full-stack developer analytics platform using Python (FastAPI) and React, integrating GitHub's GraphQL API with Redis caching to process detailed repository data efficiently while handling API rate limits.",
        "Built an AI-driven analysis layer using the OpenAI API to identify meaningful individual contributions in team and open-source projects, and to detect project frameworks and generate concise project descriptions by analyzing commits, pull requests, and configuration files.",
        "Developed an interactive 3D visualization of commit history using Three.js, making it easier to explore contribution patterns and activity trends over time."
      ],
      "skills": ["Python", "FastAPI", "React.js", "GraphQL", "Redis", "OpenAI API", "Three.js"],
      "image": "gitanalyzer.png",
      "github": "https://github.com/imjas-mine/Github-Analyzer-Backend",
      "demo": "https://gitanalyzer.me"
    },
    {
      "title": "Veterinary Website",
      "start_date": "July 2024",
      "end_date": "currently working",
      "description": [
        "Building a full-stack veterinary clinic management website for a client, combining a React.js front end with Spring Boot RESTful APIs on the back end.",
        "Implemented secure JWT authentication, allowing only admin to create, update, and delete blog posts.",
        "Used PostgreSQL database to manage user accounts and blog content, ensuring data reliability and scalability.",
        "Integrated AWS S3 for efficient cloud-based image storage and retrieval, optimizing media delivery speed and reducing local server load.",
        "Automated email notifications using Spring Mail to alert administrators of new appointment bookings.",
        "Designed a responsive UI with Tailwind CSS, delivering a seamless experience across desktop and mobile devices."
      ],
      "skills": ["React.js", "Tailwind CSS", "Spring Boot", "PostgreSQL", "JWT", "REST APIs", "AWS S3"],
      "image": "vetBlog.png",
      "github": "https://github.com/imjas-mine/Vet-blog-website",
      "demo": "https://veterinary-website-psi.vercel.app/"
    },
    {
      "title": "Simple E-Commerce Website",
      "start_date": "Jan 2025",
      "end_date": "currently working",
      "description": [
        "Developed a full-stack e-commerce application using Java and Spring Boot, implementing RESTful APIs for product management.",
        "Designed and integrated CRUD operations for products and utilized H2 with Hibernate for persistence.",
        "Developed a custom search feature using JPA and SQL, allowing users to retrieve products dynamically based on multiple fields.",
        "Implemented Spring Security to verify user login."
      ],
      "skills": ["Java", "Spring Boot", "React.js", "Spring Data JPA", "H2 Database", "Hibernate"],
      "image": "e-com_project.png",
      "github": "https://github.com/imjas-mine/e-commerce-web-app",
      "demo": ""
    },
    {
      "title": "Personal Portfolio Website",
      "start_date": "July 2024",
      "end_date": "currently working",
      "description": [
        "Built an interactive personal portfolio using React, showcasing skills, projects, and professional experience.",
        "Deployed on Vercel for fast and reliable hosting with reusable React components utilizing hooks and state management.",
        "Used Tailwind CSS for styling and JSON format for displaying dynamic data like skills and projects."
      ],
      "skills": ["React.js", "Tailwind CSS", "Vercel", "JSON"],
      "image": "personalportfolio.png",
      "github": "",
      "demo": ""
    }
  ]
}
